{
  "HomeTitle": "Développeur et artiste",
  "AcademicTitle": "3ème année en BUT informatique",
  "BodyPart1": "Étudiant français en informatique",
  "BodyPart2": "Je suis toujours en train d'essayer de nouvelles choses, avide d'apprendre, et j'essaie d'aider les autres avec mon travail",
  "Precision": "Bachelor Universitaire de Technologie",
  "Description": "Pendant mon temps libre, j'aime explorer mon côté artistique à travers le dessin. Bien que j'expérimente divers styles d'art, j'ai trouvé ma spécialité dans le dark-art et le doodle. Vous pouvez trouver mon travail sur mon compte Instagram.",

  "Projects": "Mes projets",
  "ProjectContent": "Voici quelques-uns de mes projets préférés, allant des jeux vidéo aux sites web en passant par les applications.",
  "Personal": "Personnel",
  "Uni": "Université",
  "Done": "Terminé",
  "On Going": "En cours",

  "Internship": "Stage",
  "InternshipContent1": "J'ai eu l'opportunité de travailler en tant que stagiaire web full-stack au",
  "InternshipContent2": "à Besançon, France, du 7 avril 2025 au 30 mai 2025. Ma mission était de créer une application mobile appelée « Euphron », permettant aux étudiants de l'Université de Franche-Comté de donner ou prendre du matériel sportif d'occasion sur un système de don. L'objectif est de favoriser l'accès au sport tout en promouvant la solidarité entre les étudiants.",
  "InternshipMoreAbout": "Plus d'informations sur mon stage",
  "InternshipExperience": "Développeur Web Full-Stack",
  "InternshipLocation": "Learning Centre Claude Oytana",
  "InternshipDuration": "7 avril 2025 - 30 mai 2025",

  "Skills": "Quelles sont mes compétences ?",
  "Software Development": "Développement de logiciels",
  "Back-end Web": "Back-end Web",
  "Front-end Web": "Front-end Web",
  "Game Development": "Développement de jeux",
  "Art": "Art",

  "WhyPortfolio": "Pourquoi ce Portfolio ?",
  "WhyPortfolioContent": "Ce site est développé dans le cadre de mon projet de Portfolio durant les trois années du BUT. Il sera continuellement mis à jour pour refléter mes projets académiques et personnels.",
  "Contact": "Envie de discuter, de collaborer ou simplement de dire bonjour ? N'hésitez pas à me contacter !",

  "B.I.E.N._description": "SAE-SiteInfo-BIEN est un site éducatif et interactif conçu pour sensibiliser le public à l'impact environnemental du numérique, et en particulier à la production de CO2 liée à la technologie. L'objectif principal est d'aider les utilisateurs à prendre conscience de l'empreinte carbone du secteur technologique grâce à des données visuelles et personnalisables.",
  "B.I.E.N._content": "Site web sur le changement climatique et la technologie",
  "B.I.E.N._technical_learning": "",
  "B.I.E.N._soft_learning": "",
  "B.I.E.N._challenges_learning": "",

  "SteamToLinux_content": "Vérification de la compatibilité des jeux sur Linux",
  "SteamToLinux_description": "SteamToLinux est un outil conçu pour vérifier facilement la compatibilité de vos jeux sur Linux. Il utilise l'API Steam pour accéder à votre bibliothèque de jeux et récupère des données de ProtonDB pour fournir des informations complètes sur la compatibilité.",
  "SteamToLinux_technical_learning": "",
  "SteamToLinux_soft_learning": "",
  "SteamToLinux_challenges_learning": "",

  "Spotify-tui_content": "Client Spotify en terminal plus léger que l'application originale, réalisé en C et utilisant l'API Web Spotify",
  "Spotify-tui_description": "Spotify-TUI est une interface utilisateur en terminal pour Spotify. Elle permet de contrôler votre compte Spotify depuis la ligne de commande. Vous pouvez rechercher des chansons, albums et playlists, et les lire directement depuis le terminal. Elle est encore en développement par manque de temps. L'objectif est d'en faire un client Spotify complet avec toutes les fonctionnalités du client officiel.",
  "Spotify-tui_technical_learning": "",
  "Spotify-tui_soft_learning": "",
  "Spotify-tui_challenges_learning": "",

  "Moonify_content": "Lecteur de musique avec API Imgur et Discord RPC",
  "Moonify_description": "Moonify est un lecteur de musique en ligne de commande qui vous permet d'écouter de la musique dans votre terminal. Il est conçu pour être léger et rapide, tout en offrant une expérience utilisateur agréable. Une version graphique a également été implémentée pour ceux qui ne sont pas à l'aise avec les interfaces CLI (Command-Line Interface), offrant ainsi une meilleure expérience et prise en main.",
  "Moonify_technical_learning": "Approfondissement de Python, gestion des API Imgur et Discord RPC, Optimisation des performances avec le multithreading...",
  "Moonify_soft_learning": "",
  "Moonify_challenges_learning": "",

  "ArchLinuxTutorial_description": "ArchLinuxTutorial est un guide complet pour l'installation et la configuration d'Arch Linux. Il couvre tout, de l'installation initiale à la configuration avancée, ce qui en fait une ressource précieuse pour les débutants comme pour les utilisateurs expérimentés.",
  "ArchLinuxTutorial_technical_learning": "Configuration du système, Gestion des services, Installation de paquets, Gestion des utilisateurs...",
  "ArchLinuxTutorial_soft_learning": "Création de documentation claire et concise...",
  "ArchLinuxTutorial_challenges_learning": "Gestion des dépendances, Compatibilité avec différentes versions d'Arch Linux...",

  "DnD_Prototype_description": "Prototype de jeu de rôle utilisant les règles de la 5ème édition de Dungeons And Dragons, avec un aspect similaire à un JRPG. Le jeu est encore en développement, mais l'objectif est de créer un jeu complet avec une histoire, des personnages et des combats.",
  "DnD_Prototype_technical_learning": "Approfondissement de Java, Gestion des événements, Gestion des états du jeu...",
  "DnD_Prototype_soft_learning": "",
  "DnD_Prototype_challenges_learning": "",

  "Install-UpdateDiscord_description": "Install-UpdateDiscord est un script Bash qui permet d'installer et de mettre à jour Discord sur les systèmes basés sur Linux et installe le client mod Vencord. Il est conçu pour être simple et efficace, facilitant l'installation de Discord pour les utilisateurs de Linux.",
  "Install-UpdateDiscord_technical_learning": "Approfondissement de Bash, Gestion des paquets Linux, Installation du client mod Vencord au travers de requête Curl, Automatisation des tâches, Gestion des erreurs...",
  "Install-UpdateDiscord_soft_learning": "",
  "Install-UpdateDiscord_challenges_learning": "Gestion des dépendances, Compatibilité avec différentes distributions Linux, Optimisation du script pour une meilleure performance...",

  "SoundBoard-Python_description": "SoundBoard-Python est une application de gestion de son pour n'importe qui. Elle permet de jouer des sons, de les organiser en catégories et de les associer à des touches de raccourci. C'est un projet en cours de développement, visant à offrir une interface utilisateur intuitive et des fonctionnalités avancées pour la gestion des sons.",
  "SoundBoard-Python_technical_learning": "Approfondissement de Python, Gestion des événements, Utilisation de bibliothèques tierces, Manipulation des sorties audios et virtual audio...",
  "SoundBoard-Python_soft_learning": "Communication avec les utilisateurs pour recueillir des retours...",
  "SoundBoard-Python_challenges_learning": "Gestion des performances pour éviter les latences, Optimisation de l'interface utilisateur pour une meilleure expérience avec l'utilisation de bibliothèque comme 'TKinter'...",

  "Roi-des-Roses_content": "Jeu de plateau avec JavaFX",
  "Roi-des-Roses_description": "Roi des Roses est un jeu que j'ai créé en 2024 avec une équipe de 3 étudiants. C'est un jeu de cartes basé sur le célèbre jeu 'King of Tokyo'. Le but est d'être le premier joueur à atteindre 20 points. Le jeu se joue à 2 et dure environ 30 minutes. Vous pouvez jouer contre un joueur ou contre un bot.",
  "Roi-des-Roses_technical_learning": "Approfondissement de Java et JavaFX, Gestion des événements...",
  "Roi-des-Roses_soft_learning": "Collaboration en équipe de 3 personnes, Gestion des conflits...",
  "Roi-des-Roses_challenges_learning": "Implémentation de l'IA du bot, Optimisation des performances...",

  "Vent Safe_description": "VentSafe est un petit site personnel créé pour moi et mon copain afin de pouvoir partager nos idées et nos sentiments sans avoir à ressentir le sentiment de « je te dérange » et de pouvoir nous exprimer sans contrainte.",
  "Vent Safe_technical_learning": "Approfondissement de CSS et Tailwind, Maitrise et optimisations des animations et styles pour les appareils moins performants",
  "Vent Safe_soft_learning": "Compréhension de l'importance de la communication entre des personnes, Réflexions des propos avant de les dire, Travail sur soi-même",
  "Vent Safe_challenges_learning": "Intégration et optimisations de l'utilisation des Webhooks de Discord, Automatisation d'envoie de message privé pour notifier lors de la création d'un texte",

  "DotIC_description": "DotIC (Dot Image Converter) est un générateur d'images en demi-teintes qui transforme vos images en œuvres d'art composées de points de différentes tailles en fonction de la luminance. L'effet obtenu ressemble aux techniques d'impression traditionnelles ou au tatouage moderne à points.",
  "DotIC_technical_learning": "Approfondir mes connaissances en Python, en traitement d'images et en optimisation d'algorithmes pour la génération d'œuvres d'art en demi-teintes.",
  "DotIC_soft_learning": "Améliorer mes compétences en résolution de problèmes, comprendre les besoins des utilisateurs pour une meilleure conception de l'expérience utilisateur.",
  "DotIC_challenges_learning": "Assurer la compatibilité avec divers formats d'image, optimiser les performances pour les images volumineuses et affiner l'algorithme pour une meilleure répartition des points.",

  "Website": "Site web",
  "Application": "Application",
  "Game": "Jeu",
  "finished": "Terminé",
  "in progress": "En cours",

  "ProjectDetails": "Détails du projet",
  "ProjectDescription": "Vue d'ensemble du projet",
  "ProjectLanguage": "Stack technique utilisé",
  "ProjectLearning": "Compétences développées",
  "ProjectApprentice": "Apprentissages",
  "ProjectTechnical": "Compétences techniques",
  "ProjectSoft": "Compétences humaines",
  "ProjectChallenges": "Défis relevés",
  "ProjectLink": "Lien du projet",
  "ProjectAccess": "Accéder au projet"
}
