{
  "Roi des Roses": {
    "titre": "Roi des Roses",
    "description": "Roi des Roses is a game that I created in 2024 with a team of 3 student. It is a card game based on the famous game 'King of Tokyo'. The goal is to be the first player to reach 20 points. The game is played with 2 players and takes about 30 minutes to play. You can play against a player or against a bot.",
    "language": "Java",
    "technologies": ["JavaFX", "JUnit"],
    "image": "RoiDesRoses.jpg",
    "status": "finished",
    "categorie": "Game",
    "url": "https://github.com/grothlin-iut90/Roi-des-Roses"
  },
  "B.I.E.N.": {
    "titre": "B.I.E.N.",
    "description": "SAE-SiteInfo-BIEN is an educational and interactive website designed to raise public awareness of the environmental impact of digital technology, and in particular of technology-related CO2 production. The main objective is to help users become aware of the technology sector's carbon footprint through visual and customizable data.",
    "language": ["JavaScript", "Python", "SQL"],
    "technologies": "VueJS",
    "image": "BIEN.png",
    "status": "finished",
    "categorie": "Website",
    "url": "https://github.com/grothlin-iut90/SAE-SiteInfo-BIEN"
  },
  "SteamToLinux": {
    "titre": "SteamToLinux",
    "description": "SteamToLinux is a tool designed to effortlessly check the compatibility of your games on Linux. It leverages the SteamAPI for accessing your game library and scrapes data from ProtonDB to provide comprehensive compatibility information.",
    "language": "Python",
    "technologies": "Steam API",
    "image": "SteamToLinux.jpg",
    "status": "finished",
    "categorie": "Application",
    "url": "https://github.com/moonlight58/SteamToLinux"
  },
  "Spotify-TUI": {
    "titre": "Spotify-TUI",
    "description": "Spotify-TUI is a terminal user interface for Spotify. It allows you to control your Spotify account from the command line. You can search for songs, albums, and playlists, and play them directly from the terminal. It is still in development due to the lack of time to finish it. The goal is to make it a complete Spotify client with all the features of the official client.",
    "language": "C",
    "technologies": "Spotify API", 
    "image": "SpotifyTUI.png",
    "status": "in progress",
    "categorie": "Application",
    "url": "https://github.com/moonlight58/Spotify-TUI"
  },
  "Moonify": {
    "titre": "Moonify",
    "description": "Moonify is a command-line Spotify client that lets you listen to music on your terminal. It's designed to be light and fast, while offering a pleasant user experience. A GUI version has also been implemented for people who aren't comfortable with CLIs, enabling a better experience and handling.",
    "language": "Python",
    "technologies": ["Imgur API", "Discord RPC API"],
    "image": "Moonify.png",
    "status": "finished",
    "categorie": "Application",
    "url": "https://github.com/moonlight58/Moonify"
  }
}
