{
  "Roi-des-Roses": {
    "titre": "Roi-des-Roses",
    "description": "Roi des Roses is a game that I created in 2024 with a team of 3 student. It is a card game based on the famous game 'King of Tokyo'. The goal is to be the first player to reach 20 points. The game is played with 2 players and takes about 30 minutes to play. You can play against a player or against a bot.",
    "language": "Java",
    "technologies": ["JavaFX", "JUnit"],
    "image": "Roi-des-Roses.jpg",
    "status": "finished",
    "categorie": "Game",
    "url": "https://github.com/grothlin-iut90/Roi-des-Roses"
  },
  "B.I.E.N.": {
    "titre": "B.I.E.N.",
    "description": "SAE-SiteInfo-BIEN is an educational and interactive website designed to raise public awareness of the environmental impact of digital technology, and in particular of technology-related CO2 production. The main objective is to help users become aware of the technology sector's carbon footprint through visual and customizable data.",
    "language": ["JavaScript", "Python", "SQL"],
    "technologies": "VueJS",
    "image": "BIEN.png",
    "status": "finished",
    "categorie": "Website",
    "url": "https://github.com/grothlin-iut90/SAE-SiteInfo-BIEN"
  },
  "SteamToLinux": {
    "titre": "SteamToLinux",
    "description": "SteamToLinux is a tool designed to effortlessly check the compatibility of your games on Linux. It leverages the SteamAPI for accessing your game library and scrapes data from ProtonDB to provide comprehensive compatibility information.",
    "language": "Python",
    "technologies": "Steam API",
    "image": "SteamToLinux.jpg",
    "status": "finished",
    "categorie": "Application",
    "url": "https://github.com/moonlight58/SteamToLinux"
  },
  "SpotCLI": {
    "titre": "SpotCLI",
    "description": "SpotCLI is a terminal user interface for Spotify. It allows you to control your Spotify account from the command line. You can search for songs, albums, and playlists, and play them directly from the terminal. It is still in development due to the lack of time to finish it. The goal is to make it a complete Spotify client with all the features of the official client.",
    "language": "C",
    "technologies": "Spotify Web API",
    "image": "SpotCLI.png",
    "status": "in progress",
    "categorie": "Application",
    "url": "https://github.com/moonlight58/spotCLI"
  },
  "Moonify": {
    "titre": "Moonify",
    "description": "Moonify is a command-line Spotify client that lets you listen to music on your terminal. It's designed to be light and fast, while offering a pleasant user experience. A GUI version has also been implemented for people who aren't comfortable with CLIs, enabling a better experience and handling.",
    "language": "Python",
    "technologies": ["Imgur API", "Discord RPC API"],
    "image": "Moonify.png",
    "status": "finished",
    "categorie": "Application",
    "url": "https://github.com/moonlight58/Moonify"
  },
  "ArchLinuxTutorial": {
    "titre": "ArchLinuxTutorial",
    "description": "ArchLinuxTutorial is a comprehensive guide to installing and configuring Arch Linux. It covers everything from the initial installation to advanced configuration, making it a valuable resource for both beginners and experienced users.",
    "image": "ArchLinuxTutorial.png",
    "status": "in progress",
    "categorie": "Documentation",
    "url": "https://github.com/moonlight58/ArchLinuxTutorial"
  },
  "DnD_Prototype": {
    "titre": "DnD_Prototype",
    "description": "DnD Game using the rule set of the 5th Edition Dungeons And Dragons, with a similar aspect of a JRPG. The game is still in development, but the goal is to create a complete game with a story, characters, and battles.",
    "language": "Java",
    "image": "DnD_Prototype.png",
    "status": "in progress",
    "categorie": "Game",
    "url": "https://github.com/moonlight58/DnD_Prototype"
  },
  "Install-UpdateDiscord": {
    "titre": "Install-UpdateDiscord",
    "description": "Install-UpdateDiscord is a Bash script that allows you to install and update Discord on Linux-based systems and installs the Vencord mod client. It is designed to be simple and efficient, making it easy for Linux users to install Discord.",
    "language": "Bash",
    "image": "Install-UpdateDiscord.png",
    "status": "finished",
    "categorie": "Script",
    "url": "https://github.com/moonlight58/Install-UpdateDiscord"
  },
  "SoundBoard-Python": {
    "titre": "SoundBoard-Python",
    "description": "SoundBoard-Python is a simple soundboard application made in Python. It allows you to play sounds with a simple interface made in Tkinter.",
    "language": "Python",
    "image": "SoundBoard-Python.png",
    "status": "finished",
    "categorie": "Application",
    "url": "https://github.com/moonlight58/SoundBoard-Python"
  },
  "VentSafe": {
    "titre": "Vent Safe",
    "description": "VentSafe is a small personal website made for me and my bf to be able to share our vent idea and feelings without having to feel the 'I'm disturbing you' feeling and being able to express ourselves without constraint",
    "language": "VueJS",
    "technologies": ["CSS", "Tailwind"],
    "image": "VentSafe.png",
    "status": "finished",
    "categorie": "Website",
    "url": "https://github.com/moonlight58/VentSafe"
  },
  "DotIC": {
    "titre": "DotIC",
    "description": "DotIC (Dot Image Converter), a halftone art generator that transforms your images into works of art made up of dots of varying sizes based on luminance. The resulting effect resembles traditional printing techniques or modern dot tattooing.",
    "language": "Python",
    "technologies": ["NumPy", "Matplotlib", "OpenCV"],
    "image": "DotIC.png",
    "status": "finished",
    "categorie": "Application",
    "url": "https://github.com/moonlight58/DotIC"
  }
}
